---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarFailures.BarTypeDoesNotAllowHooksOfCurrentShape
source: html/e4fab0b1-d90f-6c8a-1838-e242672349cb.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarFailures.BarTypeDoesNotAllowHooksOfCurrentShape Property

You have selected a Bar Type which does not allow the Hooks used by the current shape. Please select a different Shape / Bar Type combination, or change the Hook permissions for the desired Bar Type (see Hook Lengths under Rebar Bar properties).

## Syntax (C#)
```csharp
public static FailureDefinitionId BarTypeDoesNotAllowHooksOfCurrentShape { get; }
```